app/controllers/school_classes_controller.rb

  def create
    @class = SchoolClass.new(class_params(:title, :room_number))
    @class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Software Engineering"], ["room_number", 10], ["created_at", "2018-03-25 06:09:37.705529"], ["updated_at", "2018-03-25 06:09:37.705529"]]

  def update
    @class = SchoolClass.find(params[:id])
    @class.update(class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-03-25 06:09:37.747096"], ["id", 1]]